app/controllers/item_controller.rb

  def index
  	@allitems = Item.all
---
SELECT "items".* FROM "items"

  def edit
    @edit_item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]