app/controllers/users/registrations_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2018-11-26 16:33:04.658717"], ["updated_at", "2018-11-26 16:33:04.658717"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
   def create
    super do |resource|
      Cart.create(user_id: resource.id) # resource est l'user qui vient de se crée